owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
      if (priv->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          spiinfo("...[Repeats %d times]...\n", priv->ntimes);
        }

      /* Save information about the new access */

      priv->wrlast      = wr;
      priv->valuelast   = value;
      priv->addresslast = address;
      priv->ntimes      = 0;
    }

  /* Return true if this is the first time that we have done this operation */

  return true;
}
#endif

/****************************************************************************
 * Name: qspi_getreg
 *
 * Description:
 *  Read an QSPI register
 *
 ****************************************************************************/

static inline uint32_t qspi_getreg(struct stm32_qspidev_s *priv,
                                  unsigned int offset)
{
  uint32_t address = priv->base + offset;
  uint32_t value = getreg32(address);

#ifdef CONFIG_STM32L4_OCTOSPI_REGDEBUG
  if (qspi_checkreg(priv, false, value, address))
    {
      spiinfo("%08x->%08x\n", address, value);
    }
#endif

  return value;
}

/****************************************************************************
 * Name: qspi_putreg
 *
 * Description:
 *  Write a value to an QSPI register
 *
 ****************************************************************************/

static inline void qspi_putreg(struct stm32_qspidev_s *priv,
                               uint32_t value, unsigned int offset)
{
  uint32_t address = priv->base + offset;

#ifdef CONFIG_STM32L4_OCTOSPI_REGDEBUG
  if (qspi_checkreg(priv, true, value, address))
    {
      spiinfo("%08x<-%08x\n", address, value);
    }
#endif

  putreg32(value, address);
}

/****************************************************************************
 * Name: qspi_dumpregs
 *
 * Description:
 *   Dump the contents of all QSPI registers
 *
 * Input Parameters:
 *   priv - The QSPI controller to dump
 *   msg - Message to print before the register data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_SPI_INFO
static void qspi_dumpregs(struct stm32_qspidev_s *priv, const char *msg)
{
  spiinfo("%s:\n", msg);

  spiinfo("    CR:%08x   TCR:%08x   CCR:%08x    SR:%08x\n",
          getreg32(priv->base + STM32_OCTOSPI_CR_OFFSET),     /* Control Register */
          getreg32(priv->base + STM32_OCTOSPI_TCR_OFFSET),    /* Device Configuration Register 1 */
          getreg32(priv->base + STM32_OCTOSPI_CCR_OFFSET),    /* Communication Configuration Register */
          getreg32(priv->base + STM32_OCTOSPI_SR_OFFSET));    /* Status Register */
  spiinfo("   DLR:%08x   ABR:%08x PSMKR:%08x PSMAR:%08x\n",
          getreg32(priv->base + STM32_OCTOSPI_DLR_OFFSET),    /* Data Length Register */
          getreg32(priv->base + STM32_OCTOSPI_ABR_OFFSET),    /* Alternate Bytes Register */
          getreg32(priv->base + STM32_OCTOSPI_PSMKR_OFFSET),  /* Polling Status mask Register */
          getreg32(priv->base + STM32_OCTOSPI_PSMAR_OFFSET)); /* Polling Status match Register */
  spiinfo("   PIR:%08x  LPTR:%08x DCR1:%08x DCR2:%08x\n",
          getreg32(priv->base + STM32_OCTOSPI_PIR_OFFSET),    /* Polling Interval Register */
          getreg32(priv->base + STM32_OCTOSPI_LPTR_OFFSET),   /* Low-Power Timeout Register */
          getreg32(priv->base + STM32_OCTOSPI_DCR1_OFFSET),   /* Device Configuration Register 1 */
          getreg32(priv->base + STM32_OCTOSPI_DCR2_OFFSET));  /* Device Configuration Register 2 */
  spiinfo("   DCR3:%08x  DCR4:%08x\n",
          getreg32(priv->base + STM32_OCTOSPI_DCR3_OFFSET),   /* Device Configuration Register 3 */
          getreg32(priv->base + STM32_OCTOSPI_DCR4_OFFSET));  /* Device Configuration Register 4 */
}
#endif

#if defined(CONFIG_DEBUG_SPI_INFO) && defined(CONFIG_DEBUG_GPIO)
static void qspi_dumpgpioconfig(const char *msg)
{
  uint32_t regval;
  spiinfo("%s:\n", msg);

  /* Port B */

  regval = getreg32(STM32_GPIOB_MODER);
  spiinfo("B_MODER:%08x\n", regval);

  regval = getreg32(STM32_GPIOB_OTYPER);
  spiinfo("B_OTYPER:%08x\n", regval);

  regval = getreg32(STM32_GPIOB_OSPEED);
  spiinfo("B_OSPEED:%08x\n", regval);

  regval = getreg32(STM32_GPIOB_PUPDR);
  spiinfo("B_PUPDR:%08x\n", regval);

  regval = getreg32(STM32_GPIOB_AFRL);
  spiinfo("B_AFRL:%08x\n", regval);

  regval = getreg32(STM32_GPIOB_AFRH);
  spiinfo("B_AFRH:%08x\n", regval);

  /* Port D */

  regval = getreg32(STM32_GPIOD_MODER);
  spiinfo("D_MODER:%08x\n", regval);

  regval = getreg32(STM32_GPIOD_OTYPER);
  spiinfo("D_OTYPER:%08x\n", regval);

  regval = getreg32(STM32_GPIOD_OSPEED);
  spiinfo("D_OSPEED:%08x\n", regval);

  regval = getreg32(STM32_GPIOD_PUPDR);
  spiinfo("D_PUPDR:%08x\n", regval);

  regval = getreg32(STM32_GPIOD_AFRL);
  spiinfo("D_AFRL:%08x\n", regval);

  regval = getreg32(STM32_GPIOD_AFRH);
  spiinfo("D_AFRH:%08x\n", regval);

  /* Port E */

  regval = getreg32(STM32_GPIOE_MODER);
  spiinfo("E_MODER:%08x\n", regval);

  regval = getreg32(STM32_GPIOE_OTYPER);
  spiinfo("E_OTYPER:%08x\n", regval);

  regval = getreg32(STM32_GPIOE_OSPEED);
  spiinfo("E_OSPEED:%08x\n", regval);

  regval = getreg32(STM32_GPIOE_PUPDR);
  spiinfo("E_PUPDR:%08x\n", regval);

  regval = getreg32(STM32_GPIOE_AFRL);
  spiinfo("E_AFRL:%08x\n", regval);

  regval = getreg32(STM32_GPIOE_AFRH);
  spiinfo("E_AFRH:%08x\n", regval);
}
#endif

#ifdef CONFIG_STM32L4_OCTOSPI_DMADEBUG
/****************************************************************************
 * Name: qspi_dma_sampleinit
 *
 * Description:
 *   Initialize sampling of DMA registers
 *
 * Input Parameters:
 *   priv - QSPI driver instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void qspi_dma_sampleinit(struct stm32_qspidev_s *priv)
{
  /* Put contents of register samples into a known state */

  memset(priv->dmaregs, 0xff,
         DMA_NSAMPLES * sizeof(struct stm32l4_dmaregs_s));

  /* Then get the initial samples */

  stm32l4_dmasample(priv->dmach, &priv->dmaregs[DMA_INITIAL]);
}

/****************************************************************************
 * Name: qspi_dma_sampledone
 *
 * Description:
 *   Dump sampled DMA registers
 *
 * Input Parameters:
 *   priv - QSPI driver instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void qspi_dma_sampledone(struct stm32_qspidev_s *priv)
{
  /* Sample the final registers */

  stm32l4_dmasample(priv->dmach, &priv->dmaregs[DMA_END_TRANSFER]);

  /* Then dump the sampled DMA registers */

