owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
  if (QSPIMEM_ISDUALIO(meminfo->flags))
    {
      xctn->addrmode = CCR_ADMODE_DUAL;
    }
  else if (QSPIMEM_ISQUADIO(meminfo->flags))
    {
      xctn->addrmode = CCR_ADMODE_QUAD;
    }
  else
    {
      xctn->addrmode = CCR_ADMODE_SINGLE;
    }

  if (meminfo->addrlen == 1)
    {
      xctn->addrsize = CCR_ADSIZE_8;
    }
  else if (meminfo->addrlen == 2)
    {
      xctn->addrsize = CCR_ADSIZE_16;
    }
  else if (meminfo->addrlen == 3)
    {
      xctn->addrsize = CCR_ADSIZE_24;
    }
  else if (meminfo->addrlen == 4)
    {
      xctn->addrsize = CCR_ADSIZE_32;
    }
  else
    {
      return -EINVAL;
    }

  xctn->addr = meminfo->addr;

  /* Specify the data as needed */

  xctn->buffer = meminfo->buffer;

  /* XXX III there should be a separate flags for single/dual/quad for each
   * of i,a,d
   */

  if (QSPIMEM_ISDUALIO(meminfo->flags))
    {
      xctn->datamode = CCR_DMODE_DUAL;
    }
  else if (QSPIMEM_ISQUADIO(meminfo->flags))
    {
      xctn->datamode = CCR_DMODE_QUAD;
    }
  else
    {
      xctn->datamode = CCR_DMODE_SINGLE;
    }

  xctn->datasize = meminfo->buflen;

  /* XXX III double data rate option bits */

  xctn->isddr = 0;

#if defined(CONFIG_STM32L4_OCTOSPI_INTERRUPTS)
  xctn->function = QSPIMEM_ISWRITE(meminfo->flags) ? CR_FMODE_INDWR :
                                                     CR_FMODE_INDRD;
  xctn->disposition = - EIO;
  xctn->idxnow = 0;
#endif

  return OK;
}

/****************************************************************************
 * Name: qspi_waitstatusflags
 *
 * Description:
 *   Spin wait for specified status flags to be set as desired
 *
 * Input Parameters:
 *   priv  - The QSPI controller to dump
 *   mask  - bits to check, can be multiple
 *   polarity - true wait if any set, false to wait if all reset
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int qspi_waitstatusflags(struct stm32_qspidev_s *priv,
                                uint32_t mask, int polarity)
{
  uint32_t regval;
  volatile int timeout = 0x40000;

  if (polarity)
    {
      while (!((regval = qspi_getreg(priv, STM32_OCTOSPI_SR_OFFSET)) & mask))
        {
          if (--timeout <= 0)
            {
              spierr("ERROR: waitstatus timeout mask=0x%08lx\n",
                     (unsigned long)mask);
              return -ETIMEDOUT;
            }
        }
    }
  else
    {
      while (((regval = qspi_getreg(priv, STM32_OCTOSPI_SR_OFFSET)) & mask))
        {
          if (--timeout <= 0)
            {
              spierr("ERROR: waitstatus timeout mask=0x%08lx\n",
                     (unsigned long)mask);
              return -ETIMEDOUT;
            }
        }
    }

  return OK;
}

/****************************************************************************
 * Name: qspi_abort
 *
 * Description:
 *   Abort any transaction in progress
 *
 * Input Parameters:
 *   priv  - The QSPI controller to dump
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void qspi_abort(struct stm32_qspidev_s *priv)
{
  uint32_t regval;

  regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval |= OCTOSPI_CR_ABORT;
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
}

/****************************************************************************
 * Name: qspi_ccrconfig
 *
 * Description:
 *   Do common Communications Configuration Register setup
 *
 * Input Parameters:
 *   priv  - The QSPI controller to dump
 *   xctn  - the transaction descriptor; CCR setup
 *   fctn  - 'functional mode'; 0=indwrite, 1=indread, 2=autopoll, 3=memmmap
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void qspi_ccrconfig(struct stm32_qspidev_s *priv,
                           struct qspi_xctnspec_s *xctn,
                           uint8_t fctn)
{
  uint32_t regval;

  /* If we have data, and it's not memory mapped, write the length */

  if (CCR_DMODE_NONE != xctn->datamode && CR_FMODE_MEMMAP != fctn)
    {
      qspi_putreg(priv, xctn->datasize - 1, STM32_OCTOSPI_DLR_OFFSET);
    }

  /* If we have alternate bytes, stick them in now */

  if (xctn->altbytesmode != CCR_ABMODE_NONE)
    {
      qspi_putreg(priv, xctn->altbytes, STM32_OCTOSPI_ABR_OFFSET);
    }

  /* Build the CCR value and set it */

  regval  = OCTOSPI_CCR_IMODE(xctn->instrmode) |
            OCTOSPI_CCR_ADMODE(xctn->addrmode) |
            OCTOSPI_CCR_ADSIZE(xctn->addrsize) |
            OCTOSPI_CCR_ABMODE(xctn->altbytesmode) |
            OCTOSPI_CCR_ABSIZE(xctn->altbytessize) |
            OCTOSPI_CCR_DMODE(xctn->datamode) |
            (xctn->isddr ? OCTOSPI_CCR_DDTR : 0) |
            (xctn->isddr ? OCTOSPI_CCR_ABDTR : 0) |
            (xctn->isddr ? OCTOSPI_CCR_ADDTR : 0);
  qspi_putreg(priv, regval, STM32_OCTOSPI_CCR_OFFSET);

  regval = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval = (regval & ~(OCTOSPI_CR_FMODE_MASK)) | OCTOSPI_CR_FMODE(fctn);
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  regval = qspi_getreg(priv, STM32_OCTOSPI_TCR_OFFSET);
  regval = (regval & ~(OCTOSPI_TCR_DCYC_MASK)) |
            OCTOSPI_TCR_DCYC(xctn->dummycycles);
  qspi_putreg(priv, regval, STM32_OCTOSPI_TCR_OFFSET);

  /* Writing IR could trigger a transaction if:
   * ADMODE == 000 & (FMODE = 01 | DMODE = 000)
   */

  regval = xctn->instr;
  qspi_putreg(priv, regval, STM32_OCTOSPI_IR_OFFSET);

  /* If we have and need and address, set that now, too */

  if (CCR_ADMODE_NONE != xctn->addrmode && CR_FMODE_MEMMAP != fctn)
    {
      qspi_putreg(priv, xctn->addr, STM32_OCTOSPI_AR_OFFSET);
    }
}

#if defined(CONFIG_STM32L4_OCTOSPI_INTERRUPTS)
/****************************************************************************
 * Name: qspi0_interrupt
 *
 * Description:
 *   Interrupt handler; we handle all QSPI cases -- reads, writes,
 *   automatic status polling, etc.
 *
 * Input Parameters:
 *   irq  -
 *   context  -
 *
 * Returned Value:
 *   OK means we handled it
 *
 ****************************************************************************/

static int qspi0_interrupt(int irq, void *context, void *arg)
{
  uint32_t status;
  uint32_t cr;
  uint32_t regval;

  /* Let's find out what is going on */

