owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
  status  = qspi_getreg(&g_qspi0dev, STM32_OCTOSPI_SR_OFFSET);
  cr  = qspi_getreg(&g_qspi0dev, STM32_OCTOSPI_CR_OFFSET);

  /* Is it 'FIFO Threshold'? */

  if ((status & OCTOSPI_SR_FTF) && (cr & OCTOSPI_CR_FTIE))
    {
      volatile uint32_t *datareg =
        (volatile uint32_t *)(g_qspi0dev.base + STM32_OCTOSPI_DR_OFFSET);

      if (g_qspi0dev.xctn->function == CR_FMODE_INDWR)
        {
          /* Write data until we have no more or have no place to put it */

          while (((regval = qspi_getreg(
                 &g_qspi0dev, STM32_OCTOSPI_SR_OFFSET)) & OCTOSPI_SR_FTF) != 0)
            {
              if (g_qspi0dev.xctn->idxnow < g_qspi0dev.xctn->datasize)
                {
                  *(volatile uint8_t *)datareg =
                    ((uint8_t *)g_qspi0dev.xctn->buffer)
                    [g_qspi0dev.xctn->idxnow];
                  ++g_qspi0dev.xctn->idxnow;
                }
              else
                {
                  /* Fresh out of data to write */

                  break;
                }
            }
        }
      else if (g_qspi0dev.xctn->function == CR_FMODE_INDRD)
        {
          /* Read data until we have no more or have no place to put it */

          while (((regval = qspi_getreg(
                 &g_qspi0dev, STM32_OCTOSPI_SR_OFFSET)) & OCTOSPI_SR_FTF) != 0)
            {
              if (g_qspi0dev.xctn->idxnow < g_qspi0dev.xctn->datasize)
                {
                  ((uint8_t *)g_qspi0dev.xctn->buffer)
                    [g_qspi0dev.xctn->idxnow] = *(volatile uint8_t *)datareg;
                  ++g_qspi0dev.xctn->idxnow;
                }
              else
                {
                  /* no room at the inn */

                  break;
                }
            }
        }
    }

  /* Is it 'Transfer Complete'? */

  if ((status & OCTOSPI_SR_TCF) && (cr & OCTOSPI_CR_TCIE))
    {
      /* Acknowledge interrupt */

      qspi_putreg(&g_qspi0dev, OCTOSPI_FCR_CTCF, STM32_OCTOSPI_FCR_OFFSET);

      /* Disable the QSPI FIFO Threshold, Transfer Error and Transfer
       * complete Interrupts
       */

      regval  = qspi_getreg(&g_qspi0dev, STM32_OCTOSPI_CR_OFFSET);
      regval &= ~(OCTOSPI_CR_TEIE | OCTOSPI_CR_TCIE | OCTOSPI_CR_FTIE);
      qspi_putreg(&g_qspi0dev, regval, STM32_OCTOSPI_CR_OFFSET);

      /* Do the last bit of read if needed */

      if (g_qspi0dev.xctn->function == CR_FMODE_INDRD)
        {
          volatile uint32_t *datareg =
            (volatile uint32_t *)(g_qspi0dev.base + STM32_OCTOSPI_DR_OFFSET);

          /* Read any remaining data */

          while (((regval = qspi_getreg(
                 &g_qspi0dev, STM32_OCTOSPI_SR_OFFSET)) &
                 OCTOSPI_SR_FLEVEL_MASK) != 0)
            {
              if (g_qspi0dev.xctn->idxnow < g_qspi0dev.xctn->datasize)
                {
                  ((uint8_t *)g_qspi0dev.xctn->buffer)
                    [g_qspi0dev.xctn->idxnow] = *(volatile uint8_t *)datareg;
                  ++g_qspi0dev.xctn->idxnow;
                }
              else
                {
                  /* No room at the inn */

                  break;
                }
            }
        }

      /* Use 'abort' to ditch any stray fifo contents and clear BUSY flag */

      qspi_abort(&g_qspi0dev);

      /* Set success status */

      g_qspi0dev.xctn->disposition = OK;

      /* Signal complete */

      nxsem_post(&g_qspi0dev.op_sem);
    }

  /* Is it 'Status Match'? */

  if ((status & OCTOSPI_SR_SMF) && (cr & OCTOSPI_CR_SMIE))
    {
      /* Acknowledge interrupt */

      qspi_putreg(&g_qspi0dev, OCTOSPI_FCR_CSMF, STM32_OCTOSPI_FCR_OFFSET);

      /* If 'automatic poll mode stop' is activated, we're done */

      if (cr & OCTOSPI_CR_APMS)
        {
          /* Disable the QSPI Transfer Error and Status Match Interrupts */

          regval  = qspi_getreg(&g_qspi0dev, STM32_OCTOSPI_CR_OFFSET);
          regval &= ~(OCTOSPI_CR_TEIE | OCTOSPI_CR_SMIE);
          qspi_putreg(&g_qspi0dev, regval, STM32_OCTOSPI_CR_OFFSET);

          /* Set success status */

          g_qspi0dev.xctn->disposition = OK;

          /* Signal complete */

          nxsem_post(&g_qspi0dev.op_sem);
        }
      else
        {
          /* XXX if it's NOT auto stop; something needs to happen here;
           * a callback?
           */
        }
    }

  /* Is it' Transfer Error'? :( */

  if ((status & OCTOSPI_SR_TEF) && (cr & OCTOSPI_CR_TEIE))
    {
      /* Acknowledge interrupt */

      qspi_putreg(&g_qspi0dev, OCTOSPI_FCR_CTEF, STM32_OCTOSPI_FCR_OFFSET);

      /* Disable all the QSPI Interrupts */

      regval  = qspi_getreg(&g_qspi0dev, STM32_OCTOSPI_CR_OFFSET);
      regval &= ~(OCTOSPI_CR_TEIE | OCTOSPI_CR_TCIE | OCTOSPI_CR_FTIE |
                  OCTOSPI_CR_SMIE | OCTOSPI_CR_TOIE);
      qspi_putreg(&g_qspi0dev, regval, STM32_OCTOSPI_CR_OFFSET);

      /* Set error status; 'transfer error' means that, in 'indirect mode',
       * an invalid address is attempted to be accessed.  'Invalid' is
       * presumably relative to the FSIZE field in CCR; the manual is not
       * explicit, but what else could it be?
       */

      g_qspi0dev.xctn->disposition = - EIO;

      /* Signal complete */

      nxsem_post(&g_qspi0dev.op_sem);
    }

  /* Is it 'Timeout'? */

  if ((status & OCTOSPI_SR_TOF) && (cr & OCTOSPI_CR_TOIE))
    {
      /* Acknowledge interrupt */

      qspi_putreg(&g_qspi0dev, OCTOSPI_FCR_CTOF, STM32_OCTOSPI_FCR_OFFSET);

      /* XXX this interrupt simply means that, in 'memory mapped mode',
       * the QSPI memory has not been accessed for a while, and the
       * IP block was configured to automatically de-assert CS after
       * a timeout.  And now we're being informed that has happened.
       *
       * But who cares?  If someone does, perhaps a user callback is
       * appropriate, or some signal?  Either way, realize the xctn
       * member is /not/ valid, so you can't set the disposition
       * field.  Also, note signaling completion has no meaning here
       * because in memory mapped mode no one holds the semaphore.
       */
    }

  return OK;
}

#elif defined(CONFIG_STM32L4_OCTOSPI_DMA)
/****************************************************************************
 * Name: qspi_dma_timeout
 *
 * Description:
 *   The watchdog timeout setup when a has expired without completion of a
 *   DMA.
 *
 * Input Parameters:
 *   arg    - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

