owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
static void qspi_dma_timeout(wdparm_t arg)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)arg;
  DEBUGASSERT(priv != NULL);

  /* Sample DMA registers at the time of the timeout */

  qspi_dma_sample(priv, DMA_CALLBACK);

  /* Report timeout result, perhaps overwriting any failure reports from
   * the TX callback.
   */

  priv->result = -ETIMEDOUT;

  /* Then wake up the waiting thread */

  nxsem_post(&priv->dmawait);
}

/****************************************************************************
 * Name: qspi_dma_callback
 *
 * Description:
 *   This callback function is invoked at the completion of the QSPI DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   isr - source of the DMA interrupt
 *   arg - A pointer to the chip select structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void qspi_dma_callback(DMA_HANDLE handle, uint8_t isr, void *arg)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)arg;
  DEBUGASSERT(priv != NULL);

  /* Cancel the watchdog timeout */

  wd_cancel(&priv->dmadog);

  /* Sample DMA registers at the time of the callback */

  qspi_dma_sample(priv, DMA_CALLBACK);

  /* Report the result of the transfer only if the callback has not already
   * reported an error.
   */

  if (priv->result == -EBUSY)
    {
      /* Save the result of the transfer if no error was previously
       * reported
       */

      if (isr & DMA_STREAM_TCIF_BIT)
        {
          priv->result = OK;
        }
      else if (isr & DMA_STREAM_TEIF_BIT)
        {
          priv->result = -EIO;
        }
      else
        {
          priv->result = OK;
        }
    }

  /* Then wake up the waiting thread */

  nxsem_post(&priv->dmawait);
}

/****************************************************************************
 * Name: qspi_regaddr
 *
 * Description:
 *   Return the address of an QSPI register
 *
 ****************************************************************************/

static inline uintptr_t qspi_regaddr(struct stm32_qspidev_s *priv,
                                    unsigned int offset)
{
  return priv->base + offset;
}

/****************************************************************************
 * Name: qspi_memory_dma
 *
 * Description:
 *   Perform one QSPI memory transfer using DMA
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   meminfo - Describes the memory transfer to be performed.
 *   xctn    - Describes the transaction context.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int qspi_memory_dma(struct stm32_qspidev_s *priv,
                           struct qspi_meminfo_s *meminfo,
                           struct qspi_xctnspec_s *xctn)
{
  uint32_t dmaflags;
  uint32_t regval;
  int ret;

  /* Initialize register sampling */

  qspi_dma_sampleinit(priv);

  /* Determine DMA flags and setup the DMA */

  if (QSPIMEM_ISWRITE(meminfo->flags))
    {
      /* Setup the DMA (memory-to-peripheral) */

      dmaflags = (QSPI_DMA_PRIO | DMA_SCR_MSIZE_8BITS |
                  DMA_SCR_PSIZE_8BITS | DMA_SCR_MINC | DMA_SCR_DIR_M2P);

      up_clean_dcache((uintptr_t)meminfo->buffer,
                      (uintptr_t)meminfo->buffer + meminfo->buflen);
    }
  else
    {
      /* Setup the DMA (peripheral-to-memory) */

      dmaflags = (QSPI_DMA_PRIO | DMA_SCR_MSIZE_8BITS |
                  DMA_SCR_PSIZE_8BITS | DMA_SCR_MINC | DMA_SCR_DIR_P2M);
    }

  stm32l4_dmasetup(priv->dmach, qspi_regaddr(priv, STM32_OCTOSPI_DR_OFFSET),
                 (uint32_t)meminfo->buffer, meminfo->buflen, dmaflags);

  qspi_dma_sample(priv, DMA_AFTER_SETUP);

  /* Enable the memory transfer */

  regval = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval |= OCTOSPI_CR_DMAEN;
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  /* Set up the Communications Configuration Register as per command info */

  qspi_ccrconfig(priv, xctn,
                 QSPIMEM_ISWRITE(meminfo->flags) ? CR_FMODE_INDWR :
                                                   CR_FMODE_INDRD);

  /* Start the DMA */

  priv->result = -EBUSY;
  stm32l4_dmastart(priv->dmach, qspi_dma_callback, priv, false);

  qspi_dma_sample(priv, DMA_AFTER_START);

  /* Wait for DMA completion.  This is done in a loop because there may be
   * false alarm semaphore counts that cause nxsem_wait() not fail to wait
   * or to wake-up prematurely (for example due to the receipt of a signal).
   * We know that the DMA has completed when the result is anything other
   * that -EBUSY.
   */

  do
    {
      /* Start (or re-start) the watchdog timeout */

      ret = wd_start(&priv->dmadog, DMA_TIMEOUT_TICKS,
                     qspi_dma_timeout, (wdparm_t)priv);
      if (ret < 0)
        {
           spierr("ERROR: wd_start failed: %d\n", ret);
        }

      /* Wait for the DMA complete */

      ret = nxsem_wait(&priv->dmawait);

      if (QSPIMEM_ISREAD(meminfo->flags))
        {
          up_invalidate_dcache((uintptr_t)meminfo->buffer,
                               (uintptr_t)meminfo->buffer + meminfo->buflen);
        }

      /* Cancel the watchdog timeout */

      wd_cancel(&priv->dmadog);

      /* Check if we were awakened by an error of some kind */

      if (ret < 0)
        {
          /* EINTR is not a failure.  That simply means that the wait
           * was awakened by a signal.
           */

          if (ret != -EINTR)
            {
              DEBUGPANIC();
              regval = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
              regval &= ~OCTOSPI_CR_DMAEN;
              qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
              return ret;
            }
        }

      /* Note that we might be awakened before the wait is over due to
       * residual counts on the semaphore.  So, to handle, that case,
       * we loop until something changes the DMA result to any value other
       * than -EBUSY.
       */
    }
  while (priv->result == -EBUSY);

  /* Wait for Transfer complete, and not busy */

  qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);
  UP_MB();

  /* Dump the sampled DMA registers */

  qspi_dma_sampledone(priv);

  /* Make sure that the DMA is stopped (it will be stopped automatically
   * on normal transfers, but not necessarily when the transfer terminates
   * on an error condition).
   */

  stm32l4_dmastop(priv->dmach);

