owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
  regval = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval &= ~OCTOSPI_CR_DMAEN;
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  /* Complain if the DMA fails */

  if (priv->result)
    {
      spierr("ERROR: DMA failed with result: %d\n", priv->result);
    }

  return priv->result;
}
#endif

#if !defined(CONFIG_STM32L4_OCTOSPI_INTERRUPTS)
/****************************************************************************
 * Name: qspi_receive_blocking
 *
 * Description:
 *   Do common data receive in a blocking (status polling) way
 *
 * Input Parameters:
 *   priv  - The QSPI controller to dump
 *   xctn  - the transaction descriptor
 *
 * Returned Value:
 *   OK, or -errno on error
 *
 ****************************************************************************/

static int qspi_receive_blocking(struct stm32_qspidev_s *priv,
                                 struct qspi_xctnspec_s *xctn)
{
  int ret = OK;
  volatile uint32_t *datareg =
    (volatile uint32_t *)(priv->base + STM32_OCTOSPI_DR_OFFSET);
  uint8_t *dest = (uint8_t *)xctn->buffer;
  uint32_t addrval;
  uint32_t regval;

  addrval = qspi_getreg(priv, STM32_OCTOSPI_AR_OFFSET);
  if (dest != NULL)
    {
      /* Counter of remaining data */

      uint32_t remaining = xctn->datasize;

      /* Ensure CR register specifies indirect read */

      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval &= ~OCTOSPI_CR_FMODE_MASK;
      regval |= OCTOSPI_CR_FMODE(CR_FMODE_INDRD);
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

      /* Start the transfer by re-writing the address in AR or IR register */

      if (xctn->addrmode != CCR_ADMODE_NONE)
        {
          qspi_putreg(priv, addrval, STM32_OCTOSPI_AR_OFFSET);
        }
      else
        {
          qspi_putreg(priv, xctn->instr, STM32_OCTOSPI_IR_OFFSET);
        }

      if (qspi_getreg(priv, STM32_OCTOSPI_SR_OFFSET) & OCTOSPI_SR_TEF)
        {
          qspi_putreg(priv, OCTOSPI_FCR_CTEF, STM32_OCTOSPI_FCR_OFFSET);
          qspi_abort(priv);
          return -ENOTBLK;
        }

      while (remaining > 0)
        {
          /* Wait for Fifo Threshold, or Transfer Complete, to read data */

          qspi_waitstatusflags(priv, OCTOSPI_SR_FTF | OCTOSPI_SR_TCF, 1);

          *dest = *(volatile uint8_t *)datareg;
          dest++;
          remaining--;
        }

      if (ret == OK)
        {
          /* Wait for transfer complete, then clear it */

          qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
          qspi_putreg(priv, OCTOSPI_FCR_CTCF, STM32_OCTOSPI_FCR_OFFSET);

          /* Use Abort to clear the busy flag, and ditch any extra bytes in
           * fifo
           */

          qspi_abort(priv);
        }
    }
  else
    {
      ret = -EINVAL;
    }

  return ret;
}

/****************************************************************************
 * Name: qspi_transmit_blocking
 *
 * Description:
 *   Do common data transmit in a blocking (status polling) way
 *
 * Input Parameters:
 *   priv  - The QSPI controller to dump
 *   xctn  - the transaction descriptor
 *
 * Returned Value:
 *   OK, or -errno on error
 *
 ****************************************************************************/

static int qspi_transmit_blocking(struct stm32_qspidev_s *priv,
                                 struct qspi_xctnspec_s *xctn)
{
  int ret = OK;
  volatile uint32_t *datareg =
    (volatile uint32_t *)(priv->base + STM32_OCTOSPI_DR_OFFSET);
  uint8_t *src = (uint8_t *)xctn->buffer;

  if (src != NULL)
    {
      /* Counter of remaining data */

      uint32_t remaining = xctn->datasize;

      /* Transfer loop */

      while (remaining > 0)
        {
          /* Wait for Fifo Threshold to write data */

          qspi_waitstatusflags(priv, OCTOSPI_SR_FTF, 1);

          *(volatile uint8_t *)datareg = *src++;
          remaining--;
        }

      if (ret == OK)
        {
          /* Wait for transfer complete, then clear it */

          qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
          qspi_putreg(priv, OCTOSPI_FCR_CTCF, STM32_OCTOSPI_FCR_OFFSET);

          /* Use Abort to clear the Busy flag */

          qspi_abort(priv);
        }
    }
  else
    {
      ret = -EINVAL;
    }

  return ret;
}

#endif

/****************************************************************************
 * Name: qspi_lock
 *
 * Description:
 *   On QSPI buses where there are multiple devices, it will be necessary to
 *   lock QSPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the QSPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the QSPI is properly
 *   configured for the device.  If the QSPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock QSPI bus, false: unlock QSPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int qspi_lock(struct qspi_dev_s *dev, bool lock)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)dev;
  int ret;

  spiinfo("lock=%d\n", lock);
  if (lock)
    {
      /* Take the mutex (perhaps waiting) */

      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: qspi_setfrequency
 *
 * Description:
 *   Set the QSPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The QSPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t qspi_setfrequency(struct qspi_dev_s *dev, uint32_t frequency)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)dev;
  uint32_t actual;
  uint32_t prescaler;
  uint32_t regval;

