owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
          /* Start the transfer by re-writing the address in AR register */

          qspi_putreg(priv, addrval, STM32_OCTOSPI_AR_OFFSET);

          /* Enable 'Transfer Error' 'FIFO Threshhold' and
           * 'Transfer Complete' interrupts
           */

          regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
          regval |= (OCTOSPI_CR_TEIE | OCTOSPI_CR_FTIE | OCTOSPI_CR_TCIE);
          qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
        }
    }
  else
    {
      uint32_t regval;

      /* We have no data phase, the command will execute as soon as we emit
       * the CCR
       */

      /* Enable 'Transfer Error' and 'Transfer Complete' interrupts */

      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval |= (OCTOSPI_CR_TEIE | OCTOSPI_CR_TCIE);
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

      /* Set up the Communications Configuration Register as per command
       * info
       */

      qspi_ccrconfig(priv, &xctn, CR_FMODE_INDWR);
    }

  /* Wait for the interrupt routine to finish it's magic */

  nxsem_wait(&priv->op_sem);
  UP_MB();

  /* Convey the result */

  ret = xctn.disposition;

  /* because command transfers are so small, we're not going to use
   * DMA for them, only interrupts or polling
   */

#else
  /* Polling mode */

  /* Set up the Communications Configuration Register as per command info */

  /* That may be it, unless there is also data to transfer */

  qspi_ccrconfig(priv, &xctn, CR_FMODE_INDWR);

  if (QSPICMD_ISDATA(cmdinfo->flags))
    {
      DEBUGASSERT(cmdinfo->buffer != NULL && cmdinfo->buflen > 0);
      DEBUGASSERT(IS_ALIGNED((uintptr_t)cmdinfo->buffer, 4));

      if (QSPICMD_ISWRITE(cmdinfo->flags))
        {
          ret = qspi_transmit_blocking(priv, &xctn);
        }
      else
        {
          ret = qspi_receive_blocking(priv, &xctn);
        }

      UP_MB();
    }
  else
    {
      ret = OK;
    }

  /* Wait for Transfer complete, and not busy */

  qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

#endif

  return ret;
}

/****************************************************************************
 * Name: qspi_memory
 *
 * Description:
 *   Perform one QSPI memory transfer
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   meminfo - Describes the memory transfer to be performed.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int qspi_memory(struct qspi_dev_s *dev,
                       struct qspi_meminfo_s *meminfo)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)dev;
  struct qspi_xctnspec_s xctn;
  int ret;

  /* Reject commands issued while in memory mapped mode, which will
   * automatically cancel the memory mapping.  You must exit the
   * memory mapped mode first.
   */

  if (priv->memmap)
    {
      return -EBUSY;
    }

  /* Set up the transaction descriptor as per command info */

  ret = qspi_setupxctnfrommem(&xctn, meminfo);
  if (OK != ret)
    {
      return ret;
    }

  /* Prepare for transaction */

  /* Wait 'till non-busy */

  qspi_abort(priv);
  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  /* Clear flags */

  qspi_putreg(priv,
              OCTOSPI_FCR_CTEF | OCTOSPI_FCR_CTCF | OCTOSPI_FCR_CSMF | OCTOSPI_FCR_CTOF,
              STM32_OCTOSPI_FCR_OFFSET);

#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
  /* interrupt mode will need access to the transaction context */

  priv->xctn = &xctn;

  DEBUGASSERT(meminfo->buffer != NULL && meminfo->buflen > 0);
  DEBUGASSERT(IS_ALIGNED((uintptr_t)meminfo->buffer, 4));

  if (QSPIMEM_ISWRITE(meminfo->flags))
    {
      uint32_t regval;

      /* Set up the Communications Configuration Register as per meminfo */

      qspi_ccrconfig(priv, &xctn, CR_FMODE_INDWR);

      /* Enable 'Transfer Error' 'FIFO Threshhold' and 'Transfer Complete'
       * interrupts
       */

      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval |= (OCTOSPI_CR_TEIE | OCTOSPI_CR_FTIE | OCTOSPI_CR_TCIE);
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
    }
  else
    {
      uint32_t regval;
      uint32_t addrval;

      addrval = qspi_getreg(priv, STM32_OCTOSPI_AR_OFFSET);

      /* Set up the Communications Configuration Register as per command
       * info
       */

      qspi_ccrconfig(priv, &xctn, CR_FMODE_INDRD);

      /* Start the transfer by re-writing the address in AR register */

      qspi_putreg(priv, addrval, STM32_OCTOSPI_AR_OFFSET);

      /* Enable 'Transfer Error' 'FIFO Threshhold' and 'Transfer Complete'
       * interrupts
       */

      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval |= (OCTOSPI_CR_TEIE | OCTOSPI_CR_FTIE | OCTOSPI_CR_TCIE);
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
    }

  /* Wait for the interrupt routine to finish it's magic */

  nxsem_wait(&priv->op_sem);
  UP_MB();

  /* convey the result */

  ret = xctn.disposition;

#elif defined(CONFIG_STM32L4_OCTOSPI_DMA)
  /* Can we perform DMA?  Should we perform DMA? */

  if (priv->candma &&
      meminfo->buflen > CONFIG_STM32L4_OCTOSPI_DMATHRESHOLD &&
      IS_ALIGNED((uintptr_t)meminfo->buffer, 4) &&
      IS_ALIGNED(meminfo->buflen, 4))
    {
      ret = qspi_memory_dma(priv, meminfo, &xctn);
    }
  else
    {
      /* polling mode */

      /* Set up the Communications Configuration Register as per command
       * info
       */

      qspi_ccrconfig(priv, &xctn,
                     QSPIMEM_ISWRITE(meminfo->flags) ? CR_FMODE_INDWR :
                                                       CR_FMODE_INDRD);

      /* Transfer data */

      DEBUGASSERT(meminfo->buffer != NULL && meminfo->buflen > 0);
      DEBUGASSERT(IS_ALIGNED((uintptr_t)meminfo->buffer, 4));

      if (QSPIMEM_ISWRITE(meminfo->flags))
        {
          ret = qspi_transmit_blocking(priv, &xctn);
        }
      else
        {
          ret = qspi_receive_blocking(priv, &xctn);
        }

      /* Wait for Transfer complete, and not busy */

      qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
      qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

      UP_MB();
    }

#else
  /* polling mode */

  /* Set up the Communications Configuration Register as per command info */

  qspi_ccrconfig(priv, &xctn,
                 QSPIMEM_ISWRITE(meminfo->flags) ? CR_FMODE_INDWR :
                                                   CR_FMODE_INDRD);

