owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
  /* Transfer data */

  DEBUGASSERT(meminfo->buffer != NULL && meminfo->buflen > 0);
  DEBUGASSERT(IS_ALIGNED((uintptr_t)meminfo->buffer, 4));

  if (QSPIMEM_ISWRITE(meminfo->flags))
    {
      ret = qspi_transmit_blocking(priv, &xctn);
    }
  else
    {
      ret = qspi_receive_blocking(priv, &xctn);
    }

  /* Wait for Transfer complete, and not busy */

  qspi_waitstatusflags(priv, OCTOSPI_SR_TCF, 1);
  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  UP_MB();

#endif

  return ret;
}

/****************************************************************************
 * Name: qspi_alloc
 *
 * Description:
 *   Allocate a buffer suitable for DMA data transfer
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buflen - Buffer length to allocate in bytes
 *
 * Returned Value:
 *   Address of the allocated memory on success; NULL is returned on any
 *   failure.
 *
 ****************************************************************************/

static void *qspi_alloc(struct qspi_dev_s *dev, size_t buflen)
{
  /* Here we exploit the carnal knowledge the kmm_malloc() will return memory
   * aligned to 64-bit addresses.  The buffer length must be large enough to
   * hold the rested buflen in units a 32-bits.
   */

  /* Ensure that the DMA buffers are word-aligned. */

  return kmm_malloc(ALIGN_UP(buflen, 4));
}

/****************************************************************************
 * Name: QSPI_FREE
 *
 * Description:
 *   Free memory returned by QSPI_ALLOC
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buffer - Buffer previously allocated via QSPI_ALLOC
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void qspi_free(struct qspi_dev_s *dev, void *buffer)
{
  if (buffer)
    {
      kmm_free(buffer);
    }
}

/****************************************************************************
 * Name: qspi_hw_initialize
 *
 * Description:
 *   Initialize the QSPI peripheral from hardware reset.
 *
 * Input Parameters:
 *   priv - Device state structure.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int qspi_hw_initialize(struct stm32_qspidev_s *priv)
{
  uint32_t regval;

  /* Disable the QSPI; abort anything happening, disable, wait for not busy */

  qspi_abort(priv);

  regval  = 0;
  regval &= ~(OCTOSPI_CR_EN);
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  /* Wait till BUSY flag reset */

  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  /* Disable all interrupt sources for starters */

  regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval &= ~(OCTOSPI_CR_TEIE | OCTOSPI_CR_TCIE | OCTOSPI_CR_FTIE | OCTOSPI_CR_SMIE |
              OCTOSPI_CR_TOIE | OCTOSPI_CR_MSEL | OCTOSPI_CR_DMM);

#if defined(CONFIG_STM32L4_OCTOSPI_MODE_BANK2)
  regval |= OCTOSPI_CR_MSEL;
#endif

#if defined(CONFIG_STM32L4_OCTOSPI_MODE_DUAL)
  regval |= OCTOSPI_CR_DMM;
#endif

  /* Configure QSPI FIFO Threshold */

  regval &= ~(OCTOSPI_CR_FTHRES_MASK);
  regval |= ((CONFIG_STM32L4_OCTOSPI_FIFO_THRESHOLD - 1) <<
    OCTOSPI_CR_FTHRES_SHIFT);
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  /* Wait till BUSY flag reset */

  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  /* Configure QSPI Clock Prescaler and Sample Shift */

  regval  = qspi_getreg(priv, STM32_OCTOSPI_DCR2_OFFSET);
  regval &= ~(OCTOSPI_DCR2_PRESCALER_MASK);
  regval |= (0x01 << OCTOSPI_DCR2_PRESCALER_SHIFT);
  qspi_putreg(priv, regval, STM32_OCTOSPI_DCR2_OFFSET);

  regval  = qspi_getreg(priv, STM32_OCTOSPI_TCR_OFFSET);
  regval &= ~(OCTOSPI_TCR_SSHIFT);
  qspi_putreg(priv, regval, STM32_OCTOSPI_TCR_OFFSET);

  /* Configure QSPI Flash Size, CS High Time and Clock Mode */

  regval  = qspi_getreg(priv, STM32_OCTOSPI_DCR1_OFFSET);
  regval &= ~(OCTOSPI_DCR1_CKMODE |
              OCTOSPI_DCR1_CSHT_MASK |
              OCTOSPI_DCR1_DEVSIZE_MASK);

  regval |= ((CONFIG_STM32L4_OCTOSPI_CSHT - 1) << OCTOSPI_DCR1_CSHT_SHIFT);
  if (0 != CONFIG_STM32L4_QSPI_FLASH_SIZE)
    {
      unsigned int nsize = CONFIG_STM32L4_QSPI_FLASH_SIZE;
      int nlog2size = 31;

      while ((nsize & 0x80000000) == 0)
        {
          --nlog2size;
          nsize <<= 1;
        }

      regval |= ((nlog2size - 1) << OCTOSPI_DCR1_DEVSIZE_SHIFT);
    }

  qspi_putreg(priv, regval, STM32_OCTOSPI_DCR1_OFFSET);

  /* Enable QSPI */

  regval = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
  regval |= OCTOSPI_CR_EN;
  qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);

  /* Wait till BUSY flag reset */

  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  qspi_dumpregs(priv, "After initialization");
  qspi_dumpgpioconfig("GPIO");

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32l4_octospi_initialize
 *
 * Description:
 *   Initialize the selected QSPI port in master mode
 *
 * Input Parameters:
 *   intf - Interface number(must be zero)
 *
 * Returned Value:
 *   Valid QSPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct qspi_dev_s *stm32l4_octospi_initialize(int intf)
{
  struct stm32_qspidev_s *priv;
  uint32_t regval;
  int ret;

  /* The STM32L4+ has only a single QSPI port */

  spiinfo("intf: %d\n", intf);
  DEBUGASSERT(intf == 0);

  /* Select the QSPI interface */

  if (intf == 0)
    {
      /* If this function is called multiple times, the following operations
       * will be performed multiple times.
       */

      /* Select QSPI0 */

      priv = &g_qspi0dev;

      /* Enable clocking to the OCTOSPIM IO Manager (AHB2) */

      regval = getreg32(STM32L4_RCC_AHB2ENR);
      regval |= RCC_AHB2ENR_OSPIMEN;
      putreg32(regval, STM32L4_RCC_AHB2ENR);

      /* Enable clocking to the OCTOSPI peripheral (AHB3) */

