owhinata/nuttx/arch/arm/src/stm32l4/stm32l4_octospi.c
      regval = getreg32(STM32L4_RCC_AHB3ENR);
      regval |= RCC_AHB3ENR_OSPI1EN;
      putreg32(regval, STM32L4_RCC_AHB3ENR);

      /* Reset the OCTOSPI peripheral */

      regval = getreg32(STM32L4_RCC_AHB3RSTR);
      regval |= RCC_AHB3RSTR_OSPI1RST;
      putreg32(regval, STM32L4_RCC_AHB3RSTR);
      regval &= ~RCC_AHB3RSTR_OSPI1RST;
      putreg32(regval, STM32L4_RCC_AHB3RSTR);

      /* Configure multiplexed pins as connected on the board. */

      stm32l4_configgpio(GPIO_QSPI_CS);
      stm32l4_configgpio(GPIO_QSPI_IO0);
      stm32l4_configgpio(GPIO_QSPI_IO1);
      stm32l4_configgpio(GPIO_QSPI_IO2);
      stm32l4_configgpio(GPIO_QSPI_IO3);
      stm32l4_configgpio(GPIO_QSPI_SCK);
    }
  else
    {
      spierr("ERROR: QSPI%d not supported\n", intf);
      return NULL;
    }

  /* Has the QSPI hardware been initialized? */

  if (!priv->initialized)
    {
      /* Now perform one time initialization. */

#ifdef CONFIG_STM32L4_OCTOSPI_DMA
      /* Pre-allocate DMA channels. */

      if (priv->candma)
        {
          priv->dmach = stm32l4_dmachannel(DMACHAN_QUADSPI);
          if (!priv->dmach)
            {
              spierr("ERROR: Failed to allocate the DMA channel\n");
              priv->candma = false;
            }
        }
#endif

#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
      /* Attach the interrupt handler */

      ret = irq_attach(priv->irq, priv->handler, NULL);
      if (ret < 0)
        {
          spierr("ERROR: Failed to attach irq %d\n", priv->irq);
          goto errout_with_dmach;
        }
#endif

      /* Perform hardware initialization.  Puts the QSPI into an active
       * state.
       */

      ret = qspi_hw_initialize(priv);
      if (ret < 0)
        {
          spierr("ERROR: Failed to initialize QSPI hardware\n");
          goto errout_with_irq;
        }

      /* Enable interrupts at the NVIC */

      priv->initialized = true;
      priv->memmap = false;
#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
      up_enable_irq(priv->irq);
#endif
    }

  return &priv->qspi;

errout_with_irq:
#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
  irq_detach(priv->irq);

errout_with_dmach:
#endif
#ifdef CONFIG_STM32L4_OCTOSPI_DMA
  if (priv->dmach)
    {
      stm32l4_dmafree(priv->dmach);
      priv->dmach = NULL;
    }
#endif

  return NULL;
}

/****************************************************************************
 * Name: stm32l4_octospi_enter_memorymapped
 *
 * Description:
 *   Put the QSPI device into memory mapped mode
 *
 * Input Parameters:
 *   dev - QSPI device
 *   meminfo - parameters like for a memory transfer used for reading
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void stm32l4_octospi_enter_memorymapped(struct qspi_dev_s *dev,
                                     const struct qspi_meminfo_s *meminfo,
                                     uint32_t lpto)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)dev;
  uint32_t regval;
  struct qspi_xctnspec_s xctn;

  /* lock during this mode change */

  qspi_lock(dev, true);

  if (priv->memmap)
    {
      qspi_lock(dev, false);
      return;
    }

  /* Abort anything in-progress */

  qspi_abort(priv);

  /* Wait till BUSY flag reset */

  qspi_waitstatusflags(priv, OCTOSPI_SR_BUSY, 0);

  /* if we want the 'low-power timeout counter' */

  if (lpto > 0)
    {
      /* Set the Low Power Timeout value (automatically de-assert
       * CS if memory is not accessed for a while)
       */

      qspi_putreg(priv, lpto, STM32_OCTOSPI_LPTR_OFFSET);

      /* Clear Timeout interrupt */

      qspi_putreg(&g_qspi0dev, OCTOSPI_FCR_CTOF, STM32_OCTOSPI_FCR_OFFSET);

#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
      /* Enable Timeout interrupt */

      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval |= (OCTOSPI_CR_TCEN | OCTOSPI_CR_TOIE);
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
#endif
    }
  else
    {
      regval  = qspi_getreg(priv, STM32_OCTOSPI_CR_OFFSET);
      regval &= ~OCTOSPI_CR_TCEN;
      qspi_putreg(priv, regval, STM32_OCTOSPI_CR_OFFSET);
    }

  /* create a transaction object */

  qspi_setupxctnfrommem(&xctn, meminfo);

#ifdef CONFIG_STM32L4_OCTOSPI_INTERRUPTS
  priv->xctn = NULL;
#endif

  /* set it into the ccr */

  qspi_ccrconfig(priv, &xctn, CR_FMODE_MEMMAP);
  priv->memmap = true;

  /* we should be in memory mapped mode now */

  qspi_dumpregs(priv, "After memory mapped:");

  /* finished this mode change */

  qspi_lock(dev, false);
}

/****************************************************************************
 * Name: stm32l4_octospi_exit_memorymapped
 *
 * Description:
 *   Take the QSPI device out of memory mapped mode
 *
 * Input Parameters:
 *   dev - QSPI device
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void stm32l4_octospi_exit_memorymapped(struct qspi_dev_s *dev)
{
  struct stm32_qspidev_s *priv = (struct stm32_qspidev_s *)dev;

  qspi_lock(dev, true);

  /* A simple abort is sufficient */

  qspi_abort(priv);
  priv->memmap = false;

  qspi_lock(dev, false);
}

#endif /* CONFIG_STM32L4_OCTOSPI */
